vim.pack.add { "https://github.com/nvimdev/dashboard-nvim", "https://github.com/nvim-tree/nvim-web-devicons" }

require("dashboard").setup({
  theme = "hyper",
  config = {
    header = {
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "██╗   ██╗██╗ ██████╗ ██╗     ███████╗████████╗██╗   ██╗██╗███╗   ███╗",
      "██║   ██║██║██╔═══██╗██║     ██╔════╝╚══██╔══╝██║   ██║██║████╗ ████║",
      "██║   ██║██║██║   ██║██║     █████╗     ██║   ██║   ██║██║██╔████╔██║",
      "╚██╗ ██╔╝██║██║   ██║██║     ██╔══╝     ██║   ╚██╗ ██╔╝██║██║╚██╔╝██║",
      " ╚████╔╝ ██║╚██████╔╝███████╗███████╗   ██║    ╚████╔╝ ██║██║ ╚═╝ ██║",
      "  ╚═══╝  ╚═╝ ╚═════╝ ╚══════╝╚══════╝   ╚═╝     ╚═══╝  ╚═╝╚═╝     ╚═╝",
      "",
      "",
      "",
      "",
      "",
      "",
    },
    shortcut = {
      { icon = "󰚰 ", desc = "Update", group = "CustomGroup", action = "lua vim.pack.update()", key = "u" },
      { icon = " ", desc = "Files", group = "CustomGroup", action = "FzfLua files", key = "f" },
      { icon = " ", desc = "New File", group = "CustomGroup", action = "ene | startinsert", key = "n" },
      { icon = " ", desc = "Old files", group = "CustomGroup", action = "FzfLua oldfiles", key = "r" },
      { icon = " ", desc = "Quit Neovim", group = "CustomGroup", action = "qa!", key = "q" },
    },
    packages = { enable = true },
    project = { enable = true },
    mru = { enable = true },
    footer = {},
  }
})
